Revit 2024 API
ParameterTypeId.PathReinSpanlengthTopAlt Property
 "Top (Alternating Bar)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId PathReinSpanlengthTopAlt { get; }
Visual Basic
Public Shared ReadOnly Property PathReinSpanlengthTopAlt As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PathReinSpanlengthTopAlt {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace